blogs/vtune-introduce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-25 日 09:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>vtune 介绍</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">vtune 介绍</h1>
<p>
<a href="https://www.intel.com/content/www/us/en/developer/tools/oneapi/vtune-profiler.html">vtune</a> 是Intel推出的性能分析工具，类比一下，vtune是perf超级豪华版，可以做TMA性能、热点分析，参考：<a href="https://www.intel.com/content/www/us/en/docs/vtune-profiler/tutorial-common-bottlenecks-linux/2023-1/overview.html">vtune 教程:分析常见的性能瓶颈</a>。
使用vtune分两阶段：
</p>
<ol class="org-ol">
<li>对目标做性能采样，得到性能数据，这个阶段常常在linux服务端进行，可以把vtune的分析数据打包（tar）;</li>
<li>然后分析性能数据，优化程序，这个阶段可以在有GUI的机器进行，可以使用阶段1打包的数据，vtune的GUI很好用。</li>
</ol>

<p>
vtune的优势：
</p>
<ol class="org-ol">
<li>有TMA数据;</li>
<li>可以看到inline函数;</li>
<li>可以看到函数热点的IPC;</li>
<li>可以看到函数每行的CPU比例;</li>
<li>可以分析函数的内存瓶颈。</li>
</ol>

<p>
注意：不要贸然对线上机器使用vtune。
</p>

<div id="outline-container-org0b8c2f9" class="outline-2">
<h2 id="org0b8c2f9"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
<p>
vtune 可以在多个平台运行，<a href="https://www.intel.com/content/www/us/en/developer/tools/oneapi/vtune-profiler-download.html">vtune下载</a> 。以linux为例：
</p>

<div class="org-src-container">
<pre class="src src-bash">wget https://registrationcenter-download.intel.com/akdlm/IRC_NAS/56d0db2b-1ff1-4abe-857a-72ca9be22bd3/l_oneapi_vtune_p_2024.0.1.14_offline.sh
sudo sh ./l_oneapi_vtune_p_2024.0.1.14_offline.sh

<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">'PATH=$PATH:/opt/intel/oneapi/vtune/latest/bin64'</span> &gt; ~/.bash_profile
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc1fe49" class="outline-2">
<h2 id="orgcc1fe49"><span class="section-number-2">2</span> 教学模式</h2>
<div class="outline-text-2" id="text-2">
<p>
vtune 内置一个程序、以及它的性能采样数据。可以通过这个程序学习如何使用vtune，也可以直接使用采样好的数据。
vtune 支持复制采样命令，可以把采样命令在linux服务端运行，避免记忆复杂的命令。
</p>
</div>
</div>


<div id="outline-container-org45a257c" class="outline-2">
<h2 id="org45a257c"><span class="section-number-2">3</span> web 模式</h2>
<div class="outline-text-2" id="text-3">
<p>
vtune支持web方式使用，适合不支持GUI的环境，具体来说：
</p>
<ol class="org-ol">
<li>在（性能分析）目标机器运行vtune server，提供web访问UI;</li>
<li>访问web UI，通过web操作目标机器，性能采样、性能分析。</li>
</ol>

<p>
在目标机器运行： <code>vtune-server --allow-remote-access --enable-server-profiling</code> ，该命令启动server，同时打印一个web URL，可以通过web访问。
</p>
</div>
</div>

<div id="outline-container-org4e4da8b" class="outline-2">
<h2 id="org4e4da8b"><span class="section-number-2">4</span> 常用采样命令</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#24615;&#33021;&#24555;&#29031;&#65288;&#21547;TMA&#65289;</span>
vtune -collect performance-snapshot -resume-after 20 ./a.out
vtune -collect performance-snapshot -cpu-mask 5 -resume-after 20 taskset -c 5 ./a.out

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#38024;&#23545;&#25972;&#26426;</span>
vtune -collect performance-snapshot -d 10

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#38024;&#23545;&#27491;&#22312;&#36816;&#34892;&#30340;&#36827;&#31243;</span>
vtune -collect performance-snapshot -d 10 -target-pid=3042240

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#24615;&#33021;&#28909;&#28857;</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">-data-limit &#37319;&#38598;500M&#30340;&#25968;&#25454;&#21518;&#32467;&#26463;</span>
vtune -collect hotspots -knob sampling-mode=hw -knob stack-size=0 -data-limit=500 -r vtune001

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">-d &#37319;&#38598;10s&#25968;&#25454;&#21518;&#32467;&#26463;&#65292;&#37319;&#38598;&#35843;&#29992;&#26632;&#20449;&#24687;&#65292;&#21487;&#29992;&#30475;&#21040;&#28779;&#28976;&#22270;</span>
vtune -collect hotspots -knob sampling-mode=hw -knob sampling-interval=2 -knob enable-stack-collection=true -knob stack-size=4096 -run-pass-thru=--no-altstack -d 10 -r vtune002

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#20869;&#23384;&#20998;&#26512;</span>
vtune -collect memory-access -knob sampling-mode=hw -knob sampling-interval=1 -d 10 -r vtune003
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf3dbdf" class="outline-2">
<h2 id="orgaf3dbdf"><span class="section-number-2">5</span> container 中使用vtune</h2>
<div class="outline-text-2" id="text-5">
<p>
container中也可以使用vtune，注意事项：
</p>
<ol class="org-ol">
<li>宿主机配置 <code>sysctl -w kernel.kptr_restrict=0</code> ，这样container中可以访问kernal符号;</li>
<li>需要用nsenter进入容器，详见：<a href="https://zzyongx.github.io/blogs/operate-container-on-host.html">在宿主机上操作container</a>。</li>
</ol>
</div>
</div>

<div id="outline-container-org725f29a" class="outline-2">
<h2 id="org725f29a"><span class="section-number-2">6</span> 注意事项</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>在指定 <code>-target-pid</code> 参数时，有时候目标进程会在vtune结束时意外退出，尽量避免使用，大多数vtune功能支持结果分析时选择进程。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2024-02-25 日 09:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
